IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PLL0_CFG.xml
	<register id="CFG_pll1_SS_CTRL" acronym="CFG_pll1_SS_CTRL" offset="0x1040" width="32" description="">
		<bitfield id="BYPASS_EN" width="1" begin="31" end="31" resetval="0x1" description="Bypass the SS modulator. 1'b0 - Spread spectrum modulation is enabled 1'b1 - SSMOD is bypassed. No modulation of PLL frequency" range="31" rwaccess="R/W"/> 
		<bitfield id="WV_TBLE_MAXADDR" width="8" begin="25" end="18" resetval="0x0" description="Wave table max address. Indicates the maximum number of address bits used to access the external wave table. These bits are not used if PLL_CFG_ssm_wvtbl = 0" range="25 - 18" rwaccess="R/W"/> 
		<bitfield id="RESET" width="1" begin="15" end="15" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in reset" range="15" rwaccess="R/W"/> 
		<bitfield id="DOWNSPREAD_EN" width="1" begin="4" end="4" resetval="0x0" description="Selects center spread or down spread clock variance 1'b0 - Center spread 1'b1 - Down spread" range="4" rwaccess="R/W"/> 
		<bitfield id="WAVE_SEL" width="1" begin="0" end="0" resetval="0x0" description="Wave pattern select External wave table should only be selected if PLL_CFG_ssm_wvtbl = 1 Field values (Others are reserved): 1'b0 - Use 128 point triangle wave table 1'b1 - Use external wave table" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_SS_SPREAD" acronym="CFG_pll1_SS_SPREAD" offset="0x1044" width="32" description="">
		<bitfield id="MOD_DIV" width="4" begin="19" end="16" resetval="0x1" description="Input clock divider. This divider sets the modulation frequency. Supports divide values of 1-63" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="SPREAD" width="5" begin="4" end="0" resetval="0x1" description="Sets the spread modulation depth. The depth is spread*0.1% 5'b00000 - Reserved (don't use) 5'b00001 - 0.1% 5'b00010 - 0.2% : 5'b10000 - 1.6% : 5'b11111 - 3.1%" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_CAL_CTRL" acronym="CFG_pll1_CAL_CTRL" offset="0x1060" width="32" description="">
		<bitfield id="CAL_EN" width="1" begin="31" end="31" resetval="0x0" description="Calibration enable to actively adjust for input skew  1'b0 - Disabled. Static phase offset determined by analog matching only  1'b1 - Enabled. Static phase offset adjusted by phase sensing at input" range="31" rwaccess="R/W"/> 
		<bitfield id="FAST_CAL" width="1" begin="20" end="20" resetval="0x0" description="Fast calibration enabled  1'b0 - Normal operation  1'b1 - Used for initial calibration if initial value is not already known" range="20" rwaccess="R/W"/> 
		<bitfield id="CAL_CNT" width="3" begin="18" end="16" resetval="0x2" description="Calibration loop programmable counter. Selects the number of PFD edges to wait after each calibration step defined by 2**cal_cnt" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="CAL_BYP" width="1" begin="15" end="15" resetval="0x0" description="Calibration bypass  1'b0 - Use the calibration output to set the phase correction  1'b1 - Use the cal_in input value to set the phase correction" range="15" rwaccess="R/W"/> 
		<bitfield id="CAL_IN" width="12" begin="11" end="0" resetval="0x0" description="Calibration input  When cal_byp is 1'b0, this represents the initial condition for calibration.  When cal_byp is 1'b1, this is the override value for calibration.  Value is a signed integer with positive values delaying the faster path reset and negative values delaying the slower path reset." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_CAL_STAT" acronym="CFG_pll1_CAL_STAT" offset="0x1064" width="32" description="">
		<bitfield id="CAL_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Reserved for future use" range="31" rwaccess="R"/> 
		<bitfield id="LOCK_CNT" width="4" begin="19" end="16" resetval="0x0" description="Reserved for future use" range="19 - 16" rwaccess="R"/> 
		<bitfield id="CAL_OUT" width="12" begin="11" end="0" resetval="0x0" description="Output of the calibration block if cal_byp = 1'b0. If cal_byp = 1'b1 it is a buffer version of cal_in[11:0].  Can be used to read the phase calibration state to for later use as an override value to bypass skew calibration" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL0" acronym="CFG_pll1_HSDIV_CTRL0" offset="0x1080" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL1" acronym="CFG_pll1_HSDIV_CTRL1" offset="0x1084" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL2" acronym="CFG_pll1_HSDIV_CTRL2" offset="0x1088" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
