IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PLL0_CFG.xml
	<register id="CFG_pll1_HSDIV_CTRL3" acronym="CFG_pll1_HSDIV_CTRL3" offset="0x108C" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL4" acronym="CFG_pll1_HSDIV_CTRL4" offset="0x1090" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL5" acronym="CFG_pll1_HSDIV_CTRL5" offset="0x1094" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll1_HSDIV_CTRL6" acronym="CFG_pll1_HSDIV_CTRL6" offset="0x1098" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_PID" acronym="CFG_pll2_PID" offset="0x2000" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID follows new scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit - Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE" width="12" begin="27" end="16" resetval="0x384" description="Module functional identifier" range="27 - 16" rwaccess="R"/> 
		<bitfield id="MISC" width="5" begin="15" end="11" resetval="0x2" description="Misc revision number" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major revision number" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="custom revision number" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision number" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll2_CFG" acronym="CFG_pll2_CFG" offset="0x2008" width="32" description="">
		<bitfield id="HSDIV_PRSNT" width="16" begin="31" end="16" resetval="0x1023" description="High Speed Divider Presence  Each bit Indicates the presence of High Speed dividers 0-15.  By definition HSDIV[4:0] are connected the PLL FOUTVCO output clock and HSDIV[15:5] are connected to the PLL FOUTPOSTDIV output clock" range="31 - 16" rwaccess="R"/> 
		<bitfield id="SSM_TYPE" width="2" begin="12" end="11" resetval="0x1" description="Spread spectrum module presence  Field values (Others are reserved):  2'b00 - SSM is not present  2'b01 - SSM is present  2'b10 - Reserved  2'b11 - Reserved" range="12 - 11" rwaccess="R"/> 
		<bitfield id="SSM_WVTBL" width="1" begin="8" end="8" resetval="0x0" description="Spread spectrum wave table presence  1'b0 - SSM Wave table is not present  1'b1 - SSM Wave table is present" range="8" rwaccess="R"/> 
		<bitfield id="PLL_TYPE" width="2" begin="1" end="0" resetval="0x1" description="Indicates PLL type  Field values (Others are reserved):  2'b00 - Fractional PLL  2'b01 - FractionalF PLL  2'b10 - De-Skew PLL" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll2_LOCKKEY0" acronym="CFG_pll2_LOCKKEY0" offset="0x2010" width="32" description="">
		<bitfield id="KEY" width="31" begin="31" end="1" resetval="0x0" description="Write the kick0 unlock value followed by the kick1 unlock value to unlock the write-protected Partition2 registers" range="31 - 1" rwaccess="R/W"/> 
		<bitfield id="UNLOCKED" width="1" begin="0" end="0" resetval="0x0" description="Unlock status.   When set, indicates that the proper unlock sequence has been performed and the partition is unlocked for writing." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_pll2_LOCKKEY1" acronym="CFG_pll2_LOCKKEY1" offset="0x2014" width="32" description="">
		<bitfield id="LOCKKEY1_VAL" width="32" begin="31" end="0" resetval="0x0" description="Write the kick1 unlock value after the kick0 unlock value to unlock the write-protected Partition2 registers" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_CTRL" acronym="CFG_pll2_CTRL" offset="0x2020" width="32" description="">
		<bitfield id="BYPASS_EN" width="1" begin="31" end="31" resetval="0x1" description="Bypass enable. This controls the glitch-free bypass mux. The bypass_en bit should be set prior tomaking any changes to the PLL settings.  1'b0 - Synchronously select PLL and associated HSDIV clock outputs  1'b1 - Synchronously select the reference clock for all PLL and HSDIV clock outputs" range="31" rwaccess="R/W"/> 
		<bitfield id="BYP_ON_LOCKLOSS" width="1" begin="16" end="16" resetval="0x1" description="Bypass on loss of PLL lock. This bit controls the PLL bypass mux to automatically switch the clock source to the reference clock when the PLL losses lock.  1'b0 - Do not automatically switch to ref clock source on PLL lock loss  1'b1 - Switch to ref clock source when PLL losses lock" range="16" rwaccess="R/W"/> 
		<bitfield id="PLL_EN" width="1" begin="15" end="15" resetval="0x0" description="PLL enable  1'b0 - PLL is disabled  1'b1 - PLL is enabled " range="15" rwaccess="R/W"/> 
		<bitfield id="INTL_BYP_EN" width="1" begin="8" end="8" resetval="0x0" description="PLL internal bypass enable. This is an asynchronous mux which can produce glitches on the outputclocks during switching.  1'b0 - Output clocks are derived from the VCO clock  1'b1 - Output clocks are derived from the FREF reference clock" range="8" rwaccess="R/W"/> 
		<bitfield id="CLK_4PH_EN" width="1" begin="5" end="5" resetval="0x0" description="Enable 4-phase clock generator. This bit is ignored if clk_postdiv_en=0  1'b0 - 4-phase dividers disabled. FOUT1PHx and FOUTn clocks are held low.  1'b1 - 4-phase dividers enabled. FOUT1PH0/90/180/270 and FOUT2, FOUT3, FOUT4 clocks are enabled." range="5" rwaccess="R/W"/> 
		<bitfield id="CLK_POSTDIV_EN" width="1" begin="4" end="4" resetval="0x1" description="Post divide CLK enable  1'b0 - Post divide powered down. FOUTPOSTDIV and all auxiliary PLL clocks (4-ohase and synchronous divided clocks) are held low  1'b1 - Post divide enabled. FOUTPOSTDIV, 4-phase and synchronous clocks are enabled." range="4" rwaccess="R/W"/> 
		<bitfield id="DSM_EN" width="1" begin="1" end="1" resetval="0x0" description="Delta-Sigma modulator enable  1'b0 - Delta-Sigma modulator is disabled (use integer divide mode)  1'b1 - Delta-Sigma modulator is enabled (use fractional divide mode)" range="1" rwaccess="R/W"/> 
		<bitfield id="DAC_EN" width="1" begin="0" end="0" resetval="0x1" description="Enable fractional noise canceling DAC This bit has no function (DAC is always disabled) in integer divide mode (when dsm_en=0)  1'b0 - Fractional NC DAC is disabled (for Test modes only)  1'b1 - Fractional NC DAC is enabled (ignored in integer divide mode)" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_STAT" acronym="CFG_pll2_STAT" offset="0x2024" width="32" description="">
		<bitfield id="LOCK" width="1" begin="0" end="0" resetval="0x0" description="PLL lock status. Software should wait for lock to be asserted before clearing the PLL_CTRL_bypass_en bit  1'b0 - PLL is not locked  1'b1 - PLL is locked" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_pll2_FREQ_CTRL0" acronym="CFG_pll2_FREQ_CTRL0" offset="0x2030" width="32" description="">
		<bitfield id="FB_DIV_INT" width="12" begin="11" end="0" resetval="0x16" description="PLL feedback divider (integer portion)  In Integer mode values of 16 - 3200 (dec) are supported.  In Fractional mode values of 20 to 320 are supported.  12'h010 - Divide by 16  12'h011 - Divide by 17  :  12'h140 - Divide by 320  : 12'hC80 - Divide by 3200  12'hC81 - 12'hFFF - Not supported" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_FREQ_CTRL1" acronym="CFG_pll2_FREQ_CTRL1" offset="0x2034" width="32" description="">
		<bitfield id="FB_DIV_FRAC" width="24" begin="23" end="0" resetval="0x0" description="PLL feedback divider (fractional portion)  Supports values of 0 to 0.999999940395. The total feedback divide value is (fb_div_int + fb_div_frac / (2^24))  24'h000000 - 0  24'h000001 - .000000059605 (1/(2^24))  24'h000002 - .000000119209 (2/(2^24)) :  24'h800000 - .500000000000  : 24'hFFFFFF - .999999940395 (1677215/(2^24))" range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_DIV_CTRL" acronym="CFG_pll2_DIV_CTRL" offset="0x2038" width="32" description="">
		<bitfield id="POST_DIV2" width="3" begin="26" end="24" resetval="0x1" description="Secondary post divider. Supports values of 1-7" range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="POST_DIV1" width="3" begin="18" end="16" resetval="0x2" description="Primary post divider. To ensure correct operation, post_div1 must always be programmed to a value equal to or greater that post_div2. Supports values of 1-7i   Field values (Others are reserved):  3'b000 - Reserved (do not use)  3'b001 - Divide by 1  3'b010 - Divide by 2  3'b011 - Divide by 3  3'b100 - Divide by 4  3'b101 - Divide by 5  3'b110 - Divide by 6  3'b111 - Divide by 7" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="REF_DIV" width="6" begin="5" end="0" resetval="0x1" description="Reference clock pre-divider. Supports values of 1-63  6'b000000 - Reserved /(do not use/)  6'b000001 - Divide by 1  6'b000010 - Divide by 2  :  6'b111111 - Divide by 63" range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_SS_CTRL" acronym="CFG_pll2_SS_CTRL" offset="0x2040" width="32" description="">
		<bitfield id="BYPASS_EN" width="1" begin="31" end="31" resetval="0x1" description="Bypass the SS modulator. 1'b0 - Spread spectrum modulation is enabled 1'b1 - SSMOD is bypassed. No modulation of PLL frequency" range="31" rwaccess="R/W"/> 
		<bitfield id="WV_TBLE_MAXADDR" width="8" begin="25" end="18" resetval="0x0" description="Wave table max address. Indicates the maximum number of address bits used to access the external wave table. These bits are not used if PLL_CFG_ssm_wvtbl = 0" range="25 - 18" rwaccess="R/W"/> 
		<bitfield id="RESET" width="1" begin="15" end="15" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in reset" range="15" rwaccess="R/W"/> 
		<bitfield id="DOWNSPREAD_EN" width="1" begin="4" end="4" resetval="0x0" description="Selects center spread or down spread clock variance 1'b0 - Center spread 1'b1 - Down spread" range="4" rwaccess="R/W"/> 
		<bitfield id="WAVE_SEL" width="1" begin="0" end="0" resetval="0x0" description="Wave pattern select External wave table should only be selected if PLL_CFG_ssm_wvtbl = 1 Field values (Others are reserved): 1'b0 - Use 128 point triangle wave table 1'b1 - Use external wave table" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_SS_SPREAD" acronym="CFG_pll2_SS_SPREAD" offset="0x2044" width="32" description="">
		<bitfield id="MOD_DIV" width="4" begin="19" end="16" resetval="0x1" description="Input clock divider. This divider sets the modulation frequency. Supports divide values of 1-63" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="SPREAD" width="5" begin="4" end="0" resetval="0x1" description="Sets the spread modulation depth. The depth is spread*0.1% 5'b00000 - Reserved (don't use) 5'b00001 - 0.1% 5'b00010 - 0.2% : 5'b10000 - 1.6% : 5'b11111 - 3.1%" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_CAL_CTRL" acronym="CFG_pll2_CAL_CTRL" offset="0x2060" width="32" description="">
		<bitfield id="CAL_EN" width="1" begin="31" end="31" resetval="0x0" description="Calibration enable to actively adjust for input skew  1'b0 - Disabled. Static phase offset determined by analog matching only  1'b1 - Enabled. Static phase offset adjusted by phase sensing at input" range="31" rwaccess="R/W"/> 
		<bitfield id="FAST_CAL" width="1" begin="20" end="20" resetval="0x0" description="Fast calibration enabled  1'b0 - Normal operation  1'b1 - Used for initial calibration if initial value is not already known" range="20" rwaccess="R/W"/> 
		<bitfield id="CAL_CNT" width="3" begin="18" end="16" resetval="0x2" description="Calibration loop programmable counter. Selects the number of PFD edges to wait after each calibration step defined by 2**cal_cnt" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="CAL_BYP" width="1" begin="15" end="15" resetval="0x0" description="Calibration bypass  1'b0 - Use the calibration output to set the phase correction  1'b1 - Use the cal_in input value to set the phase correction" range="15" rwaccess="R/W"/> 
		<bitfield id="CAL_IN" width="12" begin="11" end="0" resetval="0x0" description="Calibration input  When cal_byp is 1'b0, this represents the initial condition for calibration.  When cal_byp is 1'b1, this is the override value for calibration.  Value is a signed integer with positive values delaying the faster path reset and negative values delaying the slower path reset." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_CAL_STAT" acronym="CFG_pll2_CAL_STAT" offset="0x2064" width="32" description="">
		<bitfield id="CAL_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Reserved for future use" range="31" rwaccess="R"/> 
		<bitfield id="LOCK_CNT" width="4" begin="19" end="16" resetval="0x0" description="Reserved for future use" range="19 - 16" rwaccess="R"/> 
		<bitfield id="CAL_OUT" width="12" begin="11" end="0" resetval="0x0" description="Output of the calibration block if cal_byp = 1'b0. If cal_byp = 1'b1 it is a buffer version of cal_in[11:0].  Can be used to read the phase calibration state to for later use as an override value to bypass skew calibration" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL0" acronym="CFG_pll2_HSDIV_CTRL0" offset="0x2080" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
