IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PLL0_CFG.xml
	<register id="CFG_pll2_HSDIV_CTRL1" acronym="CFG_pll2_HSDIV_CTRL1" offset="0x2084" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL2" acronym="CFG_pll2_HSDIV_CTRL2" offset="0x2088" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL3" acronym="CFG_pll2_HSDIV_CTRL3" offset="0x208C" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL4" acronym="CFG_pll2_HSDIV_CTRL4" offset="0x2090" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL5" acronym="CFG_pll2_HSDIV_CTRL5" offset="0x2094" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL6" acronym="CFG_pll2_HSDIV_CTRL6" offset="0x2098" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL7" acronym="CFG_pll2_HSDIV_CTRL7" offset="0x209C" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
