IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PLL0_CFG.xml
	<register id="CFG_pll2_HSDIV_CTRL8" acronym="CFG_pll2_HSDIV_CTRL8" offset="0x20A0" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll2_HSDIV_CTRL9" acronym="CFG_pll2_HSDIV_CTRL9" offset="0x20A4" width="32" description="">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x0" description="SSM reset. When set to 1 the SSM modulator is in resetl" range="31" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_EN" width="1" begin="15" end="15" resetval="0x0" description="CLKOUT1 enable 1'b0 - Synchronously disable CLKOUT1 1'b1 - Synchronously enable CLKOUT1" range="15" rwaccess="R/W"/> 
		<bitfield id="SYNC_DIS" width="1" begin="8" end="8" resetval="0x0" description="Disable divider synchronization logic 0 - Changes to DIV value synchronized to prevent glitches 1 - Changes are asynchronous" range="8" rwaccess="R/W"/> 
		<bitfield id="HSDIV" width="7" begin="6" end="0" resetval="0x0" description="CLKOUT0 divider value (HSDIV1+1) Allowed values are 0-127" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll8_PID" acronym="CFG_pll8_PID" offset="0x8000" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID follows new scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit - Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE" width="12" begin="27" end="16" resetval="0x384" description="Module functional identifier" range="27 - 16" rwaccess="R"/> 
		<bitfield id="MISC" width="5" begin="15" end="11" resetval="0x2" description="Misc revision number" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major revision number" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="custom revision number" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision number" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll8_CFG" acronym="CFG_pll8_CFG" offset="0x8008" width="32" description="">
		<bitfield id="HSDIV_PRSNT" width="16" begin="31" end="16" resetval="0x1" description="High Speed Divider Presence  Each bit Indicates the presence of High Speed dividers 0-15.  By definition HSDIV[4:0] are connected the PLL FOUTVCO output clock and HSDIV[15:5] are connected to the PLL FOUTPOSTDIV output clock" range="31 - 16" rwaccess="R"/> 
		<bitfield id="SSM_TYPE" width="2" begin="12" end="11" resetval="0x1" description="Spread spectrum module presence  Field values (Others are reserved):  2'b00 - SSM is not present  2'b01 - SSM is present  2'b10 - Reserved  2'b11 - Reserved" range="12 - 11" rwaccess="R"/> 
		<bitfield id="SSM_WVTBL" width="1" begin="8" end="8" resetval="0x0" description="Spread spectrum wave table presence  1'b0 - SSM Wave table is not present  1'b1 - SSM Wave table is present" range="8" rwaccess="R"/> 
		<bitfield id="PLL_TYPE" width="2" begin="1" end="0" resetval="0x1" description="Indicates PLL type  Field values (Others are reserved):  2'b00 - Fractional PLL  2'b01 - FractionalF PLL  2'b10 - De-Skew PLL" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_pll8_LOCKKEY0" acronym="CFG_pll8_LOCKKEY0" offset="0x8010" width="32" description="">
		<bitfield id="KEY" width="31" begin="31" end="1" resetval="0x0" description="Write the kick0 unlock value followed by the kick1 unlock value to unlock the write-protected Partition8 registers" range="31 - 1" rwaccess="R/W"/> 
		<bitfield id="UNLOCKED" width="1" begin="0" end="0" resetval="0x0" description="Unlock status.   When set, indicates that the proper unlock sequence has been performed and the partition is unlocked for writing." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_pll8_LOCKKEY1" acronym="CFG_pll8_LOCKKEY1" offset="0x8014" width="32" description="">
		<bitfield id="LOCKKEY1_VAL" width="32" begin="31" end="0" resetval="0x0" description="Write the kick1 unlock value after the kick0 unlock value to unlock the write-protected Partition8 registers" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_pll8_CTRL" acronym="CFG_pll8_CTRL" offset="0x8020" width="32" description="">
		<bitfield id="BYPASS_EN" width="1" begin="31" end="31" resetval="0x1" description="Bypass enable. This controls the glitch-free bypass mux. The bypass_en bit should be set prior tomaking any changes to the PLL settings.  1'b0 - Synchronously select PLL and associated HSDIV clock outputs  1'b1 - Synchronously select the reference clock for all PLL and HSDIV clock outputs" range="31" rwaccess="R/W"/> 
		<bitfield id="BYP_ON_LOCKLOSS" width="1" begin="16" end="16" resetval="0x1" description="Bypass on loss of PLL lock. This bit controls the PLL bypass mux to automatically switch the clock source to the reference clock when the PLL losses lock.  1'b0 - Do not automatically switch to ref clock source on PLL lock loss  1'b1 - Switch to ref clock source when PLL losses lock" range="16" rwaccess="R/W"/> 
		<bitfield id="PLL_EN" width="1" begin="15" end="15" resetval="0x0" description="PLL enable  1'b0 - PLL is disabled  1'b1 - PLL is enabled " range="15" rwaccess="R/W"/> 
		<bitfield id="INTL_BYP_EN" width="1" begin="8" end="8" resetval="0x0" description="PLL internal bypass enable. This is an asynchronous mux which can produce glitches on the outputclocks during switching.  1'b0 - Output clocks are derived from the VCO clock  1'b1 - Output clocks are derived from the FREF reference clock" range="8" rwaccess="R/W"/> 
		<bitfield id="CLK_4PH_EN" width="1" begin="5" end="5" resetval="0x0" description="Enable 4-phase clock generator. This bit is ignored if clk_postdiv_en=0  1'b0 - 4-phase dividers disabled. FOUT1PHx and FOUTn clocks are held low.  1'b1 - 4-phase dividers enabled. FOUT1PH0/90/180/270 and FOUT2, FOUT3, FOUT4 clocks are enabled." range="5" rwaccess="R/W"/> 
		<bitfield id="CLK_POSTDIV_EN" width="1" begin="4" end="4" resetval="0x1" description="Post divide CLK enable  1'b0 - Post divide powered down. FOUTPOSTDIV and all auxiliary PLL clocks (4-ohase and synchronous divided clocks) are held low  1'b1 - Post divide enabled. FOUTPOSTDIV, 4-phase and synchronous clocks are enabled." range="4" rwaccess="R/W"/> 
		<bitfield id="DSM_EN" width="1" begin="1" end="1" resetval="0x0" description="Delta-Sigma modulator enable  1'b0 - Delta-Sigma modulator is disabled (use integer divide mode)  1'b1 - Delta-Sigma modulator is enabled (use fractional divide mode)" range="1" rwaccess="R/W"/> 
		<bitfield id="DAC_EN" width="1" begin="0" end="0" resetval="0x1" description="Enable fractional noise canceling DAC This bit has no function (DAC is always disabled) in integer divide mode (when dsm_en=0)  1'b0 - Fractional NC DAC is disabled (for Test modes only)  1'b1 - Fractional NC DAC is enabled (ignored in integer divide mode)" range="0" rwaccess="R/W"/>
	</register>
